app/controllers/articles_controller.rb

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2021-01-16 05:44:38.436457"], ["id", 1]]
---
  def update
    @article.update(title: params[:article][:title], description: params[:article][:description])